UI_TEXT = '''
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ 1 | 'добавить заметки'     ┃
┠────────────────────────────┨
┃ 2 | 'обновление заметки'   ┃
┠────────────────────────────┨
┃ 3 | 'удаление заметки'     ┃
┠────────────────────────────┨
┃ 4 | 'просмотр всех заметок'┃
┠────────────────────────────┨
┃ 5 | 'язык'                 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
'''

WELCOME_TEXT = '''
╭━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╮
┃        Добро пожаловать!      ┃
┃          В меню выбора        ┃
╰━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╯
'''

SOLUTIONS = {
    1 : "добавить заметки",
    2 : "обновление заметки",
    3 : "удаление заметки",
    4 : "просмотр всех заметок",
    5 : "язык"
}