UI_TEXT = '''
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ 1 | 'добавить заметки'     ┃
┠────────────────────────────┨
┃ 2 | 'обновление заметки'   ┃
┠────────────────────────────┨
┃ 3 | 'удаление заметки'     ┃
┠────────────────────────────┨
┃ 4 | 'просмотр всех заметок'┃
┠────────────────────────────┨
┃ 5 | 'язык'                 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
'''

WELCOME_TEXT = '''
╭━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╮
┃        Добро пожаловать!      ┃
┃          В меню выбора        ┃
╰━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╯
'''

#_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_

SOLUTIONS = {
    1 : "добавить заметки",
    2 : "обновление заметки",
    3 : "удаление заметки",
    4 : "просмотр всех заметок",
    5 : "язык"
}

STATE = {
    1 : "add_notes",
    2 : "udate_notes",
    3 : "delete_notes",
    4 : "get_all_notes",
    5 : "select_language",
    6 : "get_all_users",
    8 : "register",
    9 : "login"
}

#_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_*_

USER_FILE_PATH = 'static/users_file.txt'